In [1]:
#  Metodos de String
# https://www.codecademy.com/learn/learn-python-3/modules/learn-python3-strings/cheatsheet
import pandas as pd

<h2>Series</h2>

In [5]:
# Series : Un array de una dimension entonces como una list en python
l = [1, 1, 2, 3, 5, 8, 13]
pd.Series(l)

0     1
1     1
2     2
3     3
4     5
5     8
6    13
dtype: int64

In [7]:
# Series creados a partir de un diccionario
l = { 'one' : 1, "two" : 2, 'three' : 3, 'four' : 4, 'five' : 5, 'six' : 6}
pd.Series(l)

one      1
two      2
three    3
four     4
five     5
six      6
dtype: int64

<h2>DataFrame</h2>


**DataFrame = Tabla de 2 dimensiones, hecha por una collección de Series**
<img src="https://lh6.googleusercontent.com/oVM0xzSQBRMeyvLbbeiIANOJPwCIc_qhoPpfR1dYe8O990yfMCoKZQjDv5WuxGZMm-lDJOOpNlee35Ur0--nuX1wpG6lKVEbAt-QO54IqI8HqOC_ZujooY5H3m_DwcJZG2wtCrPabsg=s0" >

**Ejemplos de la creación de un DataFrame**

In [10]:
data = [[1000, 'Steve', 86.29],
 [1001, 'Mathew', 91.63],
 [1002, 'Jose', 72.90],
 [1003, 'Patty', 69.23],
 [1004, 'Vin', 88.30]]

pd.DataFrame(data)

      0       1      2
0  1000   Steve  86.29
1  1001  Mathew  91.63
2  1002    Jose  72.90
3  1003   Patty  69.23
4  1004     Vin  88.30

**Especificar Filas en un DataFrame**

In [12]:
pd.DataFrame(data,columns=['Regd. No','Name', 'Marks%'],index = [1,2,3,4,5])

   Regd. No    Name  Marks%
1      1000   Steve   86.29
2      1001  Mathew   91.63
3      1002    Jose   72.90
4      1003   Patty   69.23
5      1004     Vin   88.30

**Crear un DataFrame a partir de Diccionario**

In [13]:
data = { "Regd. No" : [1000, 1001, 1002, 1003, 1004] ,
         "Names": ['Steve', 'Mathew', 'Jose', 'Patty', 'vin'],
         'Marks%' : [86.29, 91.63, 72.90, 69.23, 88.30]}
pd.DataFrame(data)
# Hay 3 series en esta tabla

   Regd. No   Names  Marks%
0      1000   Steve   86.29
1      1001  Mathew   91.63
2      1002    Jose   72.90
3      1003   Patty   69.23
4      1004     vin   88.30

**NOTA: DataFrame es una collección de una serie, columna es una serie por lo tanto una serie de columnas es un DataFrame **